prassanna-prasath/ADuCM320i/src/headers/pincm320i.h
/* Header file
 * Description: Pin definitions for ADuCM320i
 * Author: Prassanna
 */


#ifndef PINCM320I_H_
#define PINCM320I_H_

//Macros for boolean
#define ON                          1
#define HI                          1
#define OFF                         0
#define LO                          0 

/*----------------------------
Clock Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define CLKCON0     __UINT16__(0x40028000)
    #define CLKCON1     __UINT16__(0x40028004)
    #define CLKCON5     __UINT16__(0x40028014)
    #define CLKSTAT0    __UINT16__(0x40028018)
#endif

/*----------------------------
Clock Bit field definition
-----------------------------*/

typedef struct {
    unsigned CLKMUX         :2;
    unsigned                :2;
    unsigned CLKOUT         :4;
    unsigned                :3;
    unsigned PLLMUX         :1;
    unsigned                :1;
    unsigned SPLLIE         :1;
    unsigned                :1;
    unsigned HFXTALIE       :1;
} CLKCON0bits_t;

#define CLKCON0bits     (*(volatile CLKCON0bits_t *)CLKCON0)

typedef struct {
    unsigned CDHCLK         :3;
    unsigned                :5;
    unsigned CDPCLK         :3;
    unsigned CDD2DCLK       :1;
    unsigned                :4;
} CLKCON1bits_t;

#define CLKCON1bits     (*(volatile CLKCON1bits_t *)CLKCON1)

typedef struct {
    unsigned UCLKSPI0OFF    :1;
    unsigned UCLKSPI1OFF    :1;
    unsigned                :1;
    unsigned UCLKI2C0OFF    :1;
    unsigned UCLKI2C1OFF    :1;
    unsigned UCLKUARTOFF    :1;
    unsigned                :10;
} CLKCON5bits_t;

#define CLKCON5bits     (*(volatile CLKCON5bits_t *)CLKCON5)

typedef struct {
    unsigned SPLLSTATUS     :1;
    unsigned SPLLLOCK       :1;
    unsigned SPLLUNLOCK     :1;
    unsigned                :9;
    unsigned HFXTALSTATUS   :1;
    unsigned HFXTALOK       :1;
    unsigned HFXTALNOK      :1;
    unsigned                :1;
} CLKSTAT0bits_t;

#define CLKSTAT0bits    (*(volatile CLKSTAT0bits_t *)CLKSTAT0)


/*----------------------------
PWR management Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define PWR_MOD         __UINT16__(0x40002400)
    #define PWR_KEY         __UINT16__(0x40002404)
#endif

/*----------------------------
PWR management Bit field definition
-----------------------------*/

typedef struct {
    unsigned PWRMOD         :2;
    unsigned                :14;    
} PWRMODbits_t;

#define PWRMODbits      (*(volatile PWRMODbits_t *)PWR_MOD)

typedef struct {
    unsigned PWRKEY         :16;
} PWRKEYbits_t;

#define PWRKEYbits      (*(volatile PWRKEYbits_t *)PWR_KEY)

/*----------------------------
ADC Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define ADCCON          __UINT16__(0x40082174)
    #define ADCDAT0         __UINT32__(0x40086000)
    #define ADCDAT1         __UINT32__(0x40086004)
    #define ADCDAT2         __UINT32__(0x40086008)
    #define ADCDAT3         __UINT32__(0x4008600C)
    #define ADCDAT4         __UINT32__(0x40086010)
    #define ADCDAT5         __UINT32__(0x40086014)
    #define ADCDAT6         __UINT32__(0x40086018)
    #define ADCDAT7         __UINT32__(0x4008601C)
    #define ADCDAT8         __UINT32__(0x40086020)
    #define ADCDAT9         __UINT32__(0x40086024)
    #define ADCDAT10        __UINT32__(0x40086028)
    #define ADCDAT11        __UINT32__(0x4008602C)
    #define ADCDAT12        __UINT32__(0x40086030)
    #define ADCDAT13        __UINT32__(0x40086034)
    #define ADCDAT14        __UINT32__(0x40086038)
    #define ADCDAT15        __UINT32__(0x4008603C)
    #define ADCDAT16        __UINT32__(0x40086040)
    #define ADCDAT17        __UINT32__(0x40086044)
    #define ADCDAT18        __UINT32__(0x40086048)
    #define ADCDAT19        __UINT32__(0x4008604C)
    #define ADCDAT20        __UINT32__(0x40086050)
    #define ADCDAT21        __UINT32__(0x40086054)
    #define ADCDAT22        __UINT32__(0x40086058)
    #define ADCDAT23        __UINT32__(0x4008605C)
    #define ADCDAT24        __UINT32__(0x40086060)
    #define ADCDAT25        __UINT32__(0x40086064)
    #define ADCDAT26        __UINT32__(0x40086068)
    #define ADCDAT27        __UINT32__(0x4008606C)
    #define ADCCHA          __UINT16__(0x40086080)
    #define ADCSEQ          __UINT32__(0x40086088)
    #define ADCSEQC         __UINT32__(0x4008608C)
    #define ADCCMP          __UINT32__(0x40086098)
    #define ADCCNVC         __UINT32__(0x4008609C)
#endif

/*----------------------------
ADC Bit field definition
-----------------------------*/
typedef struct {
    unsigned C_TYPE         :3;
    unsigned CNV_DMA        :1;
    unsigned SEQ_DMA        :1;
    unsigned                :1;
    unsigned RESTART_ADC    :1;
    unsigned REFB_PUP       :1;  
    unsigned                :1;
    unsigned PUP            :1;
    unsigned SOFT_RESET     :1;
    unsigned                :5;
} ADCCONbits_t;

#define ADCCONbits      (*(volatile ADCCONbits_t *)ADCCON)

typedef struct {
    unsigned ADCCP          :5;
    unsigned                :3;
    unsigned ADCCN          :5;
    unsigned                :3;
} ADCCHAbits_t;

#define ADCCHAbits      (*(volatile ADCCHAbits_t *)ADCCHA)

typedef struct {
    unsigned CH             :29;
    unsigned                :1;
    unsigned EN             :1;
    unsigned ST             :1;
} ADCSEQbits_t;

#define ADCSEQbits      (*(volatile ADCSEQbits_t *)ADCSEQ)

typedef struct {
    unsigned DIF0           :5;
    unsigned DIF2           :5;
    unsigned DIF4           :5;
    unsigned DIF6           :5;
    unsigned T              :8;
    unsigned                :4;
} ADCSEQCbits_t;

#define ADCSEQCbits      (*(volatile ADCSEQCbits_t *)ADCSEQC)

typedef struct {
    unsigned EN             :1;
    unsigned DIR            :1;
    unsigned THR            :16;
    unsigned                :16;
} ADCCMPbits_t;

#define ADCCMPbits      (*(volatile ADCCMPbits_t *)ADCCMP)

