prassanna-prasath/ADuCM320i/src/headers/pincm320i.h
typedef struct {
    unsigned ADC_SOFTCONV           :1;
    unsigned ADC_SEQ                :1;
    unsigned DCOMP                  :1;
    unsigned ACOMP                  :1;
    unsigned IDAC_TSHUT             :1;
    unsigned IDAC_EXTRESLOW         :1;
    unsigned RDECC_ERR              :1;
    unsigned WRECC_ERR              :1;
} INTSTAbits_t;

#define INTSTAbits     (*(volatile INTSTAbits_t *)INTSTA)

/*----------------------------
Reset Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define RSTCFG          __UINT16__(0x40002408)
    #define RST_KEY         __UINT16__(0x4000240C)
    #define RSTSTA          __UINT16__(0x40002440)
    #define LVRST           __UINT16__(0x40082C34)
#endif

/*----------------------------
Reset Bit field definition
-----------------------------*/
typedef struct {
    unsigned GPIO_PLA_RETAIN    :1;
    unsigned                    :15;
} RSTCFGbits_t;

#define RSTCFGbits     (*(volatile RSTCFGbits_t *)RSTCFG)

typedef struct {
    unsigned RSTKEY             :16;
} RSTKEYbits_t;

#define RSTKEYbits      (*(volatile RSTKEYbits_t *)RST_KEY)

typedef struct {
    unsigned POR            :1;
    unsigned EXTRST         :1;
    unsigned WDRST          :1;
    unsigned SWRST          :1;
    unsigned                :12; 
} RSTSTAbits_t;

#define RSTSTAbits      (*(volatile RSTSTAbits_t *)RSTSTA)

typedef struct {
    unsigned RETAIN             :1;
    unsigned                    :15;
} LVRSTbits_t;

#define LVRSTbits       (*(volatile LVRSTbits_t *)LVRST)

/*----------------------------
DMA Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define DMASTA          __UINT32__(0x40010000)
    #define DMACFG          __UINT32__(0x40010004)
    #define DMAPDBPTR       __UINT32__(0x40010008)
    #define DMAADBPTR       __UINT32__(0x4001000C)
    #define DMASWREQ        __UINT32__(0x40010014)
    #define DMARMSKSET      __UINT32__(0x40010020)
    #define DMARMSKCLR      __UINT32__(0x40010024)
    #define DMAENSET        __UINT32__(0x40010028)
    #define DMAENCLR        __UINT32__(0x4001002C)
    #define DMAALTSET       __UINT32__(0x40010030)
    #define DMAALTCLR       __UINT32__(0x40010034)
    #define DMAPRISET       __UINT32__(0x40010038)
    #define DMAPRICLR       __UINT32__(0x4001003C)
    #define DMAERRCLR       __UINT32__(0x4001004C)
    #define DMABSSET        __UINT32__(0x40010800)
    #define DMABSCLR        __UINT32__(0x40010804)
#endif

/*----------------------------
DMA Bit field Definitions
-----------------------------*/

typedef struct {
    unsigned MENABLE            :1;
    unsigned                    :3;
    unsigned STATE              :4;
    unsigned                    :8;
    unsigned CHNLSM1            :5;
    unsigned                    :11;
} DMASTAbits_t;

#define DMASTAbits      (*(volatile DMASTAbits_t *)DMASTA)

typedef struct {
    unsigned MENABLE            :1;
    unsigned                    :31;
} DMACFGbits_t;

#define DMACFGbits      (*(volatile DMACFGbits_t *)DMACFG)

typedef struct {
    unsigned CTRLBASEPTR        :32;
} DMAPDBPTRbits_t;

#define DMAPDBPTRbits   (*(volatile DMAPDBPTRbits_t *)DMAPDBPTR)

typedef struct {
    unsigned ALTCBPTR           :32;
} DMAADBPTRbits_t;

#define DMAADBPTRbits   (*(volatile DMAADBPTRbits_t *)DMAADBPTR)

typedef struct {
    unsigned CHSWREQ            :14;
    unsigned                    :8;
} DMASWREQbits_t;

#define DMASWREQbits    (*(volatile DMASWREQbits_t *)DMASWREQ)

typedef struct {
    unsigned CHREQMSET          :14;
    unsigned                    :8;
} DMARMSKSETbits_t;

#define DMARMSKSETbits  (*(volatile DMARMSKSETbits_t *)DMARMSKSET)

typedef struct {
    unsigned CHREQMCLR          :14;
    unsigned                    :8;
} DMARMSKCLRbits_t;

#define DMARMSKCLRbits  (*(volatile DMARMSKCLRbits_t *)DMARMSKCLR)

typedef struct {
    unsigned CHENSET            :14;
    unsigned                    :8;
} DMAENSETbits_t;

#define DMAENSETbits    (*(volatile DMAENSETbits_t *)DMAENSET)

typedef struct {
    unsigned CHENCLR            :14;
    unsigned                    :8;
} DMAENCLRbits_t;

#define DMAENCLRbits    (*(volatile DMAENCLRbits_t *)DMAENCLR)

typedef struct {
    unsigned CHPRIALTSET        :14;
    unsigned                    :8;
} DMAALTSETbits_t;

#define DMAALTSETbits   (*(volatile DMAALTSETbits_t *)DMAALTSET)

typedef struct {
    unsigned CHPRIALTCLR        :14;
    unsigned                    :8;
} DMAALTCLRbits_t;

#define DMAALTCLRbits   (*(volatile DMAALTCLRbits_t *)DMAALTCLR)

typedef struct {
    unsigned CHPRISET           :14;
    unsigned                    :8;
} DMAPRISETbits_t;

#define DMAPRISETbits   (*(volatile DMAPRISETbits_t *)DMAPRISET)

typedef struct {
    unsigned CHPRICLR           :14;
    unsigned                    :8;
} DMAPRICLRbits_t;

#define DMAPRICLRbits   (*(volatile DMAPRICLRbits_t *)DMAPRICLR)

typedef struct {
    unsigned ERRCLR             :14;
    unsigned                    :8;
} DMAERRCLRbits_t;

#define DMAERRCLRbits   (*(volatile DMAERRCLRbits_t *)DMAERRCLR)

typedef struct {
    unsigned CHBSWAPSET         :14;
    unsigned                    :8;
} DMABSSETbits_t;

#define DMABSSETbits    (*(volatile DMABSSETbits_t *)DMABSSET)

typedef struct {
    unsigned CHBSWAPCLR         :14;
    unsigned                    :8;
} DMABSCLRbits_t;

#define DMABSCLRbits    (*(volatile DMABSCLRbits_t *)DMABSCLR)

/*----------------------------
Flash Controller Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define FEESTA              __UINT32__(0x40018000)
    #define FEECON0             __UINT32__(0x40018004)
    #define FEECMD              __UINT32__(0x40018008)
    #define FEEFLADR            __UINT32__(0x4001800C)
    #define FEEFLDATA0          __UINT32__(0x40018010)
    #define FEEFLDATA1          __UINT32__(0x40018014)
    #define FEEADR0             __UINT32__(0x40018018)
    #define FEEADR1             __UINT32__(0x4001801C)
    #define FEEKEY              __UINT32__(0x40018020)
    #define FEEPRO0             __UINT32__(0x40018028)
    #define FEEPRO1             __UINT32__(0x4001802C)
    #define FEESIG              __UINT32__(0x40018034)
    #define FEECON1             __UINT32__(0x40018038)
    #define FEEWRADDRA          __UINT32__(0x40018040)
    #define FEEAEN0             __UINT32__(0x40018048)
    #define FEEAEN1             __UINT32__(0x4001804C)
    #define FEEECCCONFIG        __UINT32__(0x40018064)
    #define FEEECCADDR0         __UINT32__(0x40018074)
    #define FEEECCADDR1         __UINT32__(0x40018078)
    #define CACHESTAT           __UINT32__(0x400180C0)
    #define CACHESETUP          __UINT32__(0x400180C4)
    #define CACHEKEY            __UINT32__(0x400180C8)
#endif

/*----------------------------
Flash Controller Bit field Definitions
-----------------------------*/
typedef struct {
    unsigned CMDBUSY            :1;
    unsigned WRCLOSE            :1;
    unsigned CMDDONE            :1;
    unsigned WRALMOSTDONE       :1;
    unsigned CMDRES             :2;
    unsigned                    :1;
    unsigned ECCERRCMD          :2;
    unsigned ECCREADERRFLSH0    :2;
    unsigned ECCREADERRFLSH1    :2;
    unsigned SIGNERR            :1;
    unsigned ECCERRSIGN         :3;
    unsigned ECCCOUNTFLASH      :3;
    unsigned                    :3;
    unsigned ECCCOUNTFLASH1     :3;
    unsigned ECCREADERRDBUS     :2;
    unsigned ECCREADERRIBUS     :2;
    unsigned                    :3;
} FEESTAbits_t;

