prassanna-prasath/ADuCM320i/src/headers/pincm320i.h
#define FEESTAbits      (*(volatile FEESTAbits_t *)FEESTA)

typedef struct {
    unsigned IENCMD             :1;
    unsigned IWRALCOMP          :1;
    unsigned IENERR             :1;
    unsigned                    :29;
} FEECON0bits_t;

#define FEECON0bits      (*(volatile FEECON0bits_t *)FEECON0)

typedef struct {
    unsigned CMD                :5;
    unsigned                    :27;
} FEECMDbits_t;

#define FEECMDbits      (*(volatile FEECMDbits_t *)FEECMD)

typedef struct {
    unsigned                    :3;
    unsigned FLADDR             :16;
    unsigned                    :13;
} FEEFLADRbits_t;

#define FEEFLADRbits    (*(volatile FEEFLADRbits_t *)FEEFLADR)

typedef struct {
    unsigned FLDATA0            :32;
} FEEFLDATA0bits_t;

#define FEEFLDATA0bits  (*(volatile FEEFLDATA0bits_t *)FEEFLDATA0)

typedef struct {
    unsigned FLDATA1            :32;
} FEEFLDATA1bits_t;

#define FEEFLDATA1bits  (*(volatile FEEFLDATA1bits_t *)FEEFLDATA1)

typedef struct {
    unsigned                    :11;
    unsigned PAGEADDR0          :8;
    unsigned                    :13;
} FEEADR0bits_t;

#define FEEADR0bits     (*(volatile FEEADR0bits_t *)FEEADR0)

typedef struct {
    unsigned                    :11;
    unsigned PAGEADDR1          :8;
    unsigned                    :13;
} FEEADR1bits_t;

#define FEEADR1bits     (*(volatile FEEADR1bits_t *)FEEADR1)

typedef struct {
    unsigned KEY                :32;
} FEEKEYbits_t;

#define FEEKEYbits      (*(volatile FEEKEYbits_t *)FEEKEY)

typedef struct {
    unsigned WRPROT0            :32;
} FEEPRO0bits_t;

#define FEEPRO0bits     (*(volatile FEEPRO0bits_t *)FEEPRO0)

typedef struct {
    unsigned SIGN               :24;
    unsigned                    :8;
} FEESIGbits_t;

#define FEESIGbits      (*(volatile FEESIGbits_t *)FEESIG)

typedef struct {
    unsigned DBG                :1;
    unsigned KHDMA              :1;
    unsigned INCR               :1;
    unsigned SWAP               :1;
    unsigned MDIO               :1;
    unsigned                    :27;
} FEECON1bits_t;

#define FEECON1bits     (*(volatile FEECON1bits_t *)FEECON1)

typedef struct {
    unsigned WRABORTADDR        :32;
} FEEWRADDRAbits_t;

#define FEEWRADDRAbits  (*(volatile FEEWRADDRAbits_t *)FEEWRADDRA)

typedef struct {
    unsigned SYSIRQABORTEN      :32;
} FEEAEN0bits_t;

#define FEEAEN0bits     (*(volatile FEEAEN0bits_t *)FEEAEN0)

typedef struct {
    unsigned SYSIRQABORTEN      :32;
} FEEAEN1bits_t;

#define FEEAEN1bits     (*(volatile FEEAEN1bits_t *)FEEAEN1)

typedef struct {
    unsigned ECCDISABLE         :1;
    unsigned ECCCMDAHBEN        :2;
    unsigned ECCCMDINTEN        :2;
    unsigned                    :27;
} FEEECCCONFIGbits_t;

#define FEEECCCONFIGbits    (*(volatile FEEECCCONFIGbits_t *)FEEECCCONFIG)

typedef struct {
    unsigned VALUE              :19;
    unsigned                    :13;
} FEEECCADDR0bits_t;

#define FEEECCADDR0bits (*(volatile FEEECCADDR0bits_t *)FEEECCADDR0)

typedef struct {
    unsigned VALUE              :19;
    unsigned                    :13;
} FEEECCADDR1bits_t;

#define FEEECCADDR1bits (*(volatile FEEECCADDR1bits_t *)FEEECCADDR1)

typedef struct {
    unsigned IINIT              :1;
    unsigned IEN                :1;
    unsigned ILOCK              :1;
    unsigned                    :12;
    unsigned DINIT              :1;
    unsigned DEN                :1;
    unsigned DLOCK              :1;
    unsigned                    :12;
} CACHESTATbits_t;

#define CACHESTATbits   (*(volatile CACHESTATbits_t *)CACHESTAT)

typedef struct {
    unsigned IINIT              :1;
    unsigned IEN                :1;
    unsigned ILOCK              :1;
    unsigned IWRBUF             :1;
    unsigned IRDBUF             :1;
    unsigned                    :11;
    unsigned DINIT              :1;
    unsigned DEN                :1;
    unsigned DLOCK              :1;
    unsigned DWRBUF             :1;
    unsigned                    :21;
} CACHESETUPbits_t;

#define CACHESETUPbits  (*(volatile CACHESETUPbits_t *)CACHESETUP)

typedef struct {
    unsigned KEY                :32;
} CACHEKEYbits_t;

#define CACHEKEYbits    (*(volatile CACHEKEYbits_t *)CACHEKEY)

/*----------------------------
Si Verification Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define CHIPID              __UINT16__(0x40002024)
#define LV_ID                __UINT16__(0x40082C30)
#endif

/*----------------------------
Si Verification Bit field definition
-----------------------------*/

typedef struct {
    unsigned REV            :4;
    unsigned PARTID         :12;
} CHIPIDbits_t;

#define CHIPIDbits      (*(volatile CHIPIDbits_t *)CHIPID)

typedef struct {
    unsigned LVREV          :4;
    unsigned LVID           :12;   
} LVIDbits_t;

#define LVIDbits        (*(volatile LVIDbits_t *)LVID)

/*----------------------------
GPIO Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define GP0CON              __UINT16__(0x40020000)
    #define GP1CON              __UINT16__(0x40020040)
    #define GP2CON              __UINT16__(0x40020080)
    #define GP3CON              __UINT16__(0x400200C0)
    #define GP4CON              __UINT16__(0x40020100)
    #define GP5CON              __UINT16__(0x40020140)
    /*-------*/
    #define GP0OE               __UINT8__(0x40020004)
    #define GP1OE               __UINT8__(0x40020044)
    #define GP2OE               __UINT8__(0x40020084)
    #define GP3OE               __UINT8__(0x400200C4)
    #define GP4OE               __UINT8__(0x40020104)
    #define GP5OE               __UINT8__(0x40020144)
    /*-------*/
    #define GP0PUL              __UINT8__(0x40020008)
    #define GP1PUL              __UINT8__(0x40020048)
    #define GP2PUL              __UINT8__(0x40020088)
    #define GP3PUL              __UINT8__(0x400200C8)
    #define GP4PUL              __UINT8__(0x40020108)
    #define GP5PUL              __UINT8__(0x40020148)
    /*-------*/
    #define GP0IE               __UINT8__(0x4002000C)
    #define GP1IE               __UINT8__(0x4002004C)
    #define GP2IE               __UINT8__(0x4002008C)
    #define GP3IE               __UINT8__(0x400200CC)
    #define GP4IE               __UINT8__(0x4002010C)
    #define GP5IE               __UINT8__(0x4002014C)
    /*-------*/
    #define GP0IN               __UINT8__(0x40020010)
    #define GP1IN               __UINT8__(0x40020050)
    #define GP2IN               __UINT8__(0x40020090)
    #define GP3IN               __UINT8__(0x400200D0)
    #define GP4IN               __UINT8__(0x40020110)
    #define GP5IN               __UINT8__(0x40020150)
    /*-------*/
    #define GP0OUT              __UINT8__(0x40020014)
    #define GP0OUT              __UINT8__(0x40020014)
    #define GP1OUT              __UINT8__(0x40020054)
    #define GP2OUT              __UINT8__(0x40020094)
    #define GP3OUT              __UINT8__(0x400200D4)
    #define GP4OUT              __UINT8__(0x40020114)
    #define GP5OUT              __UINT8__(0x40020154)
    /*-------*/
    #define GP0SET              __UINT8__(0x40020018)
    #define GP1SET              __UINT8__(0x40020058)
    #define GP2SET              __UINT8__(0x40020098)
    #define GP3SET              __UINT8__(0x400200D8)
    #define GP4SET              __UINT8__(0x40020118)
    #define GP5SET              __UINT8__(0x40020158)
    /*-------*/
    #define GP0CLR              __UINT8__(0x4002001C)
    #define GP1CLR              __UINT8__(0x4002005C)
    #define GP2CLR              __UINT8__(0x4002009C)
    #define GP3CLR              __UINT8__(0x400200DC)
    #define GP4CLR              __UINT8__(0x4002011C)
    #define GP5CLR              __UINT8__(0x4002015C)
    /*-------*/
    #define GP0TGL              __UINT8__(0x40020020)
    #define GP1TGL              __UINT8__(0x40020060)
    #define GP2TGL              __UINT8__(0x400200A0)
    #define GP3TGL              __UINT8__(0x400200E0)
    #define GP4TGL              __UINT8__(0x40020120)
    #define GP5TGL              __UINT8__(0x40020160)
    /*-------*/
    #define GP0ODE              __UINT8__(0x40020024)
    #define GP1ODE              __UINT8__(0x40020064)
    #define GP2ODE              __UINT8__(0x400200A4)
    #define GP3ODE              __UINT8__(0x400200E4)
    #define GP4ODE              __UINT8__(0x40020124)
    #define GP5ODE              __UINT8__(0x40020164)
#endif

/*----------------------------
GPIO Byte Registers
-----------------------------*/
typedef struct {
    unsigned CON0           :2;
    unsigned CON1           :2;
    unsigned CON2           :2;
    unsigned CON3           :2;
    unsigned CON4           :2;
    unsigned CON5           :2;
    unsigned CON6           :2;
    unsigned CON7           :2;    
} GPxCONbits_t;

#define GP0CONbits      (*(volatile GPxCONbits_t *)GP0CON)
#define GP1CONbits      (*(volatile GPxCONbits_t *)GP1CON)
#define GP2CONbits      (*(volatile GPxCONbits_t *)GP2CON)
#define GP3CONbits      (*(volatile GPxCONbits_t *)GP3CON)
#define GP4CONbits      (*(volatile GPxCONbits_t *)GP4CON)
#define GP5CONbits      (*(volatile GPxCONbits_t *)GP5CON)

