prassanna-prasath/ADuCM320i/src/headers/pincm320i.h
typedef struct {
    unsigned OE             :8;
} GPxOEbits_t;

#define GP0OEbits       (*(volatile GPxOEbits_t *)GP0OE)
#define GP1OEbits       (*(volatile GPxOEbits_t *)GP1OE)
#define GP2OEbits       (*(volatile GPxOEbits_t *)GP2OE)
#define GP3OEbits       (*(volatile GPxOEbits_t *)GP3OE)
#define GP4OEbits       (*(volatile GPxOEbits_t *)GP4OE)
#define GP5OEbits       (*(volatile GPxOEbits_t *)GP5OE)

typedef struct {
    unsigned PUL            :8;
} GPxPULbits_t;

/*Pull ups*/
#define GP0PULbits      (*(volatile GPxPULbits_t *)GP0PUL)
#define GP1PULbits      (*(volatile GPxPULbits_t *)GP1PUL)
#define GP2PULbits      (*(volatile GPxPULbits_t *)GP2PUL)
#define GP3PULbits      (*(volatile GPxPULbits_t *)GP3PUL)
/*Pull downs*/
#define GP4PULbits      (*(volatile GPxPULbits_t *)GP4PUL)
#define GP5PULbits      (*(volatile GPxPULbits_t *)GP5PUL)

typedef struct {
    unsigned IEN            :8; 
} GPxIEbits_t;

#define GP0IEbits       (*(volatile GPxIEbits_t *)GP0IE)
#define GP1IEbits       (*(volatile GPxIEbits_t *)GP1IE)
#define GP2IEbits       (*(volatile GPxIEbits_t *)GP2IE)
#define GP3IEbits       (*(volatile GPxIEbits_t *)GP3IE)
#define GP4IEbits       (*(volatile GPxIEbits_t *)GP4IE)
#define GP5IEbits       (*(volatile GPxIEbits_t *)GP5IE)

typedef struct {
    unsigned IN             :8;
} GPxINbits_t;

#define GP0INbits       (*(volatile GPxINbits_t *)GP0IN)
#define GP1INbits       (*(volatile GPxINbits_t *)GP1IN)
#define GP2INbits       (*(volatile GPxINbits_t *)GP2IN)
#define GP3INbits       (*(volatile GPxINbits_t *)GP3IN)
#define GP4INbits       (*(volatile GPxINbits_t *)GP4IN)
#define GP5INbits       (*(volatile GPxINbits_t *)GP5IN)

typedef struct {
    unsigned OUT            :8;
} GPxOUTbits_t;

#define GP0OUTbits      (*(volatile GPxOUTbits_t *)GP0OUT)
#define GP1OUTbits      (*(volatile GPxOUTbits_t *)GP1OUT)
#define GP2OUTbits      (*(volatile GPxOUTbits_t *)GP2OUT)
#define GP3OUTbits      (*(volatile GPxOUTbits_t *)GP3OUT)
#define GP4OUTbits      (*(volatile GPxOUTbits_t *)GP4OUT)
#define GP5OUTbits      (*(volatile GPxOUTbits_t *)GP5OUT)

typedef struct {
    unsigned CLR            :8;
} GPxCLRbits_t;

#define GP0CLRbits      (*(volatile GPxCLRbits_t *)GP0CLR)
#define GP1CLRbits      (*(volatile GPxCLRbits_t *)GP1CLR)
#define GP2CLRbits      (*(volatile GPxCLRbits_t *)GP2CLR)
#define GP3CLRbits      (*(volatile GPxCLRbits_t *)GP3CLR)
#define GP4CLRbits      (*(volatile GPxCLRbits_t *)GP4CLR)
#define GP5CLRbits      (*(volatile GPxCLRbits_t *)GP5CLR)

typedef struct {
    unsigned TGL            :8;
} GPxTGLbits_t;

#define GP0TGLbits      (*(volatile GPxTGLbits_t *)GP0TGL)
#define GP1TGLbits      (*(volatile GPxTGLbits_t *)GP1TGL)
#define GP2TGLbits      (*(volatile GPxTGLbits_t *)GP2TGL)
#define GP3TGLbits      (*(volatile GPxTGLbits_t *)GP3TGL)
#define GP4TGLbits      (*(volatile GPxTGLbits_t *)GP4TGL)
#define GP5TGLbits      (*(volatile GPxTGLbits_t *)GP5TGL)

typedef struct {
    unsigned ODE            :8;
} GPxODEbits_t;

#define GP0ODEbits      (*(volatile GPxODEbits_t *)GP0ODE)
#define GP1ODEbits      (*(volatile GPxODEbits_t *)GP1ODE)
#define GP2ODEbits      (*(volatile GPxODEbits_t *)GP2ODE)
#define GP3ODEbits      (*(volatile GPxODEbits_t *)GP3ODE)
#define GP4ODEbits      (*(volatile GPxODEbits_t *)GP4ODE)
#define GP5ODEbits      (*(volatile GPxODEbits_t *)GP5ODE)

/*----------------------------
I2C0 Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define I2C0MCON            __UINT16__(0x40003000)
    #define I2C0MSTA            __UINT16__(0x40003004)
    #define I2C0MRX             __UINT16__(0x40003008)
    #define I2C0MTX             __UINT16__(0x4000300C)
    #define I2C0MRXCNT          __UINT16__(0x40003010)
    #define I2C0MCRXCNT         __UINT16__(0x40003014)
    #define I2C0ADR0            __UINT16__(0x40003018)
    #define I2C0ADR1            __UINT16__(0x4000301C)
    #define I2C0DIV             __UINT16__(0x40003024)
    #define I2C0SCON            __UINT16__(0x40003028)
    #define I2C0SSTA            __UINT16__(0x4000302C)
    #define I2C0SRX             __UINT16__(0x40003030)
    #define I2C0STX             __UINT16__(0x40003034)
    #define I2C0ALT             __UINT16__(0x40003038)
    #define I2C0ID0             __UINT16__(0x4000303C)
    #define I2C0ID1             __UINT16__(0x40003040)
    #define I2C0ID2             __UINT16__(0x40003044)
    #define I2C0ID3             __UINT16__(0x40003048)
    #define I2C0FSTA            __UINT16__(0x4000304C)
    #define I2C0SHCON           __UINT16__(0x40003050)
    #define I2C0ASSCL           __UINT16__(0x40003058)
#endif

/*----------------------------
I2C1 Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define I2C1MCON            __UINT16__(0x40003400)
    #define I2C1MSTA            __UINT16__(0x40003404)
    #define I2C1MRX             __UINT16__(0x40003408)
    #define I2C1MTX             __UINT16__(0x4000340C)
    #define I2C1MRXCNT          __UINT16__(0x40003410)
    #define I2C1MCRXCNT         __UINT16__(0x40003414)
    #define I2C1ADR0            __UINT16__(0x40003418)
    #define I2C1ADR1            __UINT16__(0x4000341C)
    #define I2C1DIV             __UINT16__(0x40003424)
    #define I2C1SCON            __UINT16__(0x40003428)
    #define I2C1SSTA            __UINT16__(0x4000342C)
    #define I2C1SRX             __UINT16__(0x40003430)
    #define I2C1STX             __UINT16__(0x40003434)
    #define I2C1ALT             __UINT16__(0x40003438)
    #define I2C1ID0             __UINT16__(0x4000343C)
    #define I2C1ID1             __UINT16__(0x40003440)
    #define I2C1ID2             __UINT16__(0x40003444)
    #define I2C1ID3             __UINT16__(0x40003448)
    #define I2C1FSTA            __UINT16__(0x4000344C)
    #define I2C1SHCON           __UINT16__(0x40003450)
    #define I2C1ASSCL           __UINT16__(0x40003458)
#endif

/*----------------------------
I2C0/1 Bit field definitions
-----------------------------*/
typedef struct {
    unsigned MASEN              :1;
    unsigned COMPETE            :1;
    unsigned LOOPBACK           :1;
    unsigned                    :1;
    unsigned IENMRX             :1;
    unsigned IENMTX             :1;
    unsigned IENALOST           :1;
    unsigned IENACK             :1;
    unsigned IENCMP             :1;
    unsigned                    :1;
    unsigned MRXDMA             :1;
    unsigned MTXDMA             :1;
    unsigned                    :1;
} I2CxMCONbits_t;

#define I2C0MCONbits    (*(volatile I2CxMCONbits_t *)I2C0MCON)
#define I2C1MCONbits    (*(volatile I2CxMCONbits_t *)I2C1MCON)

