prassanna-prasath/ADuCM320i/src/headers/pincm320i.h
typedef struct {
    unsigned MTXFSTA            :2;
    unsigned MTXREQ             :1;
    unsigned MRXREQ             :1;
    unsigned NACKADDR           :1;
    unsigned ALOST              :1;
    unsigned MBUSY              :1;
    unsigned NACKDATA           :1;
    unsigned TCOMP              :1;
    unsigned MRXOF              :1;
    unsigned LINEBUSY           :1;
    unsigned MSTOP              :1;
    unsigned MTXUFLOW           :1;
    unsigned SDA_FILTERED       :1;
    unsigned SCL_FILTERED       :1;
    unsigned                    :1;
} I2CxMSTAbits_t;

#define I2C0MSTAbits    (*(volatile I2CxMSTAbits_t *)I2C0MSTA)
#define I2C1MSTAbits    (*(volatile I2CxMSTAbits_t *)I2C1MSTA)

typedef struct {
    unsigned ICMRX              :8;
    unsigned                    :8;
} I2CxMRXbits_t;

#define I2C0MRXbits     (*(volatile I2CxMRXbits_t *)I2C0MRX)
#define I2C1MRXbits     (*(volatile I2CxMRXbits_t *)I2C1MRX)

typedef struct {
    unsigned ICMTX              :8;
    unsigned                    :8;
} I2CxMTXbits_t;

#define I2C0MTXbits     (*(volatile I2CxMTXbits_t *)I2C0MTX)
#define I2C1MTXbits     (*(volatile I2CxMTXbits_t *)I2C1MTX)

typedef struct {
    unsigned COUNT              :8;
    unsigned EXTEND             :1;
    unsigned                    :7;
} I2CxMRXCNTbits_t;

#define I2C0MRXCNTbits  (*(volatile I2CxMRXCNTbits_t *)I2C0MRXCNT)
#define I2C1MRXCNTbits  (*(volatile I2CxMRXCNTbits_t *)I2C1MRXCNT)

typedef struct {
    unsigned COUNT              :8;
    unsigned                    :8;
} I2CxMCRXCNTbits_t;

#define I2C0MCRXCNTbits (*(volatile I2CxMCRXCNTbits_t *)I2C0MCRXCNT)
#define I2C1MCRXCNTbits (*(volatile I2CxMCRXCNTbits_t *)I2C1MCRXCNT)

typedef struct {
    unsigned ADR0               :8;
    unsigned                    :8;
} I2CxADR0bits_t;

#define I2C0ADR0bits    (*(volatile I2CxADR0bits_t *)I2C0ADR0)
#define I2C1ADR0bits    (*(volatile I2CxADR0bits_t *)I2C1ADR0)

typedef struct {
    unsigned ADR1               :8;
    unsigned                    :8;
} I2CxADR1bits_t;

#define I2C0ADR1bits    (*(volatile I2CxADR0bits_t *)I2C0ADR1)
#define I2C1ADR1bits    (*(volatile I2CxADR0bits_t *)I2C1ADR1)

typedef struct {
    unsigned LOW                :8;
    unsigned HIGH               :8;
} I2CxDIVbits_t;

#define I2C0DIVbits     (*(volatile I2CxDIVbits_t *)I2C0DIV)
#define I2C1DIVbits     (*(volatile I2CxDIVbits_t *)I2C1DIV)

typedef struct {
    unsigned SLVEN              :1;
    unsigned ADR10EN            :1;
    unsigned GCEN               :1;
    unsigned HGCEN              :1;
    unsigned GCSBCLR            :1;
    unsigned EARLYTXR           :1;
    unsigned                    :1;
    unsigned NACK               :1;
    unsigned IENSTOP            :1;
    unsigned IENSRX             :1;
    unsigned IENSTX             :1;
    unsigned                    :1;
    unsigned IENREPST           :1;
    unsigned SRXDMA             :1;
    unsigned STXDMA             :1;
    unsigned                    :1;
} I2CxSCONbits_t;

#define I2C0SCONbits    (*(volatile I2CxSCONbits_t *)I2C0SCON)
#define I2C1SCONbits    (*(volatile I2CxSCONbits_t *)I2C1SCON)

typedef struct {
    unsigned STXFSEREQ          :1;
    unsigned STXUR              :1;
    unsigned STXREQ             :1;
    unsigned SRXREQ             :1;
    unsigned SRXOF              :1;
    unsigned NOACK              :1;
    unsigned SBUSY              :1;
    unsigned GCINT              :1;
    unsigned GCID               :2;
    unsigned STOP               :1;
    unsigned IDMAT              :2;
    unsigned REPSTART           :1;
    unsigned START              :1;
    unsigned                    :1;
} I2CxSSTAbits_t;

#define I2C0SSTAbits    (*(volatile I2CxSSTAbits_t *)I2C0SSTA)
#define I2C1SSTAbits    (*(volatile I2CxSSTAbits_t *)I2C1SSTA)

typedef struct {
    unsigned ICSRX              :8;
    unsigned                    :8;
} I2CxSRXbits_t;

#define I2C0SRXbits     (*(volatile I2CxSRXbits_t *)I2C0SRX)
#define I2C1SRXbits     (*(volatile I2CxSRXbits_t *)I2C1SRX)

typedef struct {
    unsigned ICSTX              :8;
    unsigned                    :8;
} I2CxSTXbits_t;

#define I2C0STXbits     (*(volatile I2CxSTXbits_t *)I2C0STX)
#define I2C1STXbits     (*(volatile I2CxSTXbits_t *)I2C1STX)

typedef struct {
    unsigned ALT                :8;
    unsigned                    :8;
} I2CxALTbits_t;

#define I2C0ALTbits     (*(volatile I2CxALTbits_t *)I2C0ALT)
#define I2C1ALTbits     (*(volatile I2CxALTbits_t *)I2C1ALT)

typedef struct {
    unsigned ID0                :8;
    unsigned                    :8;
} I2CxID0bits_t;

#define I2C0ID0bits     (*(volatile I2CxID0bits_t *)I2C0ID0)
#define I2C1ID0bits     (*(volatile I2CxID0bits_t *)I2C1ID0)

typedef struct {
    unsigned ID1                :8;
    unsigned                    :8;
} I2CxID1bits_t;

#define I2C0ID1bits     (*(volatile I2CxID1bits_t *)I2C0ID1)
#define I2C1ID1bits     (*(volatile I2CxID1bits_t *)I2C1ID1)

typedef struct {
    unsigned ID2                :8;
    unsigned                    :8;
} I2CxID2bits_t;

#define I2C0ID2bits     (*(volatile I2CxID2bits_t *)I2C0ID2)
#define I2C1ID2bits     (*(volatile I2CxID2bits_t *)I2C1ID2)

typedef struct {
    unsigned ID3                :8;
    unsigned                    :8;
} I2CxID3bits_t;

#define I2C0ID3bits     (*(volatile I2CxID3bits_t *)I2C0ID3)
#define I2C1ID3bits     (*(volatile I2CxID3bits_t *)I2C1ID3)

typedef struct {
    unsigned STXFSTA            :2;
    unsigned SRXFSTA            :2;
    unsigned MTXFSTA            :2;
    unsigned MRXFSTA            :2;
    unsigned SFLUSH             :1;
    unsigned MFLUSH             :1;
    unsigned                    :6;
} I2CxFSTAbits_t;

#define I2C0FSTAbits    (*(volatile I2CxFSTAbits_t *)I2C0FSTA)
#define I2C1FSTAbits    (*(volatile I2CxFSTAbits_t *)I2C1FSTA)

typedef struct {
    unsigned RESET              :1;
    unsigned                    :15;
} I2CxSHCONbits_t;

#define I2C0SHCONbits   (*(volatile I2CxSHCONbits_t *)I2C0SHCON)
#define I2C1SHCONbits   (*(volatile I2CxSHCONbits_t *)I2C1SHCON)

