prassanna-prasath/ADuCM320i/src/headers/pincm320i.h
typedef struct {
    unsigned DTR            :1;
    unsigned RTS            :1;
    unsigned OUT1           :1;
    unsigned OUT2           :1;
    unsigned LOOPBACK       :1;
    unsigned                :11;
} COMMCRbits_t;

#define COMMCRbits      (*(volatile COMMCRbits_t *)COMMCR)

typedef struct {
    unsigned DR             :1;
    unsigned OE             :1;
    unsigned PE             :1;
    unsigned FE             :1;
    unsigned BI             :1;
    unsigned THRE           :1;
    unsigned TEMT           :1;
    unsigned                :9;
} COMLSRbits_t;

#define COMLSRbits      (*(volatile COMLSRbits_t *)COMLSR)

typedef struct {
    unsigned DCTS           :1;
    unsigned DDSR           :1;
    unsigned TERI           :1;
    unsigned DDCD           :1;
    unsigned CTS            :1;
    unsigned DSR            :1;
    unsigned RI             :1;
    unsigned DCD            :1;
    unsigned                :8;
} COMMSRbits_t;

#define COMMSRbits      (*(volatile COMMSRbits_t *)COMMSR)

typedef struct {
    unsigned SCR            :8;
    unsigned                :8;
} COMSCRbits_t;

#define COMSCRbits      (*(volatile COMSCRbits_t *)COMSCR)

typedef struct {
    unsigned DIVN           :11;
    unsigned DIVM           :2;
    unsigned                :2;
    unsigned FBEN           :1;
} COMFBRbits_t;

#define COMFBRbits      (*(volatile COMFBRbits_t *)COMFBR)

typedef struct {
    unsigned DIv            :16;
} COMDIVbits_t;

#define COMDIVbits      (*(volatile COMDIVbits_t *)COMDIV)

/*----------------------------
General Purpose Timers Byte Registers
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define T0LD            __UINT16__(0x40000000)
    #define T0VAL           __UINT16__(0x40000004)
    #define T0CON           __UINT16__(0x40000008)
    #define T0CLRI          __UINT16__(0x4000000C)
    #define T0CAP           __UINT16__(0x40000010)
    #define T0STA           __UINT16__(0x4000001C)

    #define T1LD            __UINT16__(0x40000400)
    #define T1VAL           __UINT16__(0x40000404)
    #define T1CON           __UINT16__(0x40000408)
    #define T1CLRI          __UINT16__(0x4000040C)
    #define T1CAP           __UINT16__(0x40000410)
    #define T1STA           __UINT16__(0x4000041C)

    #define T1LD            __UINT16__(0x40000800)
    #define T1VAL           __UINT16__(0x40000804)
    #define T1CON           __UINT16__(0x40000808)
    #define T1CLRI          __UINT16__(0x4000080C)
    #define T1CAP           __UINT16__(0x40000810)
    #define T1STA           __UINT16__(0x4000081C)
#endif

/*----------------------------
General Purpose Timers bit field definitions
-----------------------------*/

typedef struct {
    unsigned LOAD           :16;
} TxLDbits_t;

#define T0LDbits        (*(volatile TxLDbits_t *)T0LDbit)
#define T1LDbits        (*(volatile TxLDbits_t *)T1LDbit)
#define T2LDbits        (*(volatile TxLDbits_t *)T2LDbit)

typedef struct {
    unsigned VAL            :16;
} TxVALbits_t;

#define T0VALbits       (*(volatile TxVALbits_t *)T0VAL)
#define T1VALbits       (*(volatile TxVALbits_t *)T1VAL)
#define T2VALbits       (*(volatile TxVALbits_t *)T2VAL)

typedef struct {
    unsigned PRE            :2;
    unsigned UP             :1;
    unsigned MOD            :1;
    unsigned ENABLE         :1;
    unsigned CLK            :1;
    unsigned RLD            :2;
    unsigned EVENT          :4;
    unsigned EVENTEN        :1;
    unsigned                :3;
} TxCONbits_t;

#define T0CONbits       (*(volatile TxCONbits_t *)T0CON)
#define T1CONbits       (*(volatile TxCONbits_t *)T1CON)
#define T2CONbits       (*(volatile TxCONbits_t *)T2CON)

typedef struct {
    unsigned TMOUT          :1;
    unsigned CAP            :1;
    unsigned                :14;
} TxCLRIbits_t;

#define T0CLRI          (*(volatile TxCLRIbits_t *)T0CLRI)
#define T1CLRI          (*(volatile TxCLRIbits_t *)T1CLRI)
#define T2CLRI          (*(volatile TxCLRIbits_t *)T2CLRI)

typedef struct {
    unsigned CAP            :16;
} TxCAPbits_t;

#define T0CAPbits       (*(volatile TxCAPbits_t *)T0CAP)
#define T1CAPbits       (*(volatile TxCAPbits_t *)T1CAP)
#define T2CAPbits       (*(volatile TxCAPbits_t *)T2CAP)

typedef struct {
    unsigned TMOUT          :1;
    unsigned CAP            :1;
    unsigned                :3;
    unsigned BUSY           :1;
    unsigned PDOK           :1;
    unsigned                :8;
} TxSTAbits_t;

#define T0STAbits       (*(volatile TxSTAbits_t *)T0STA)
#define T1STAbits       (*(volatile TxSTAbits_t *)T1STA)
#define T2STAbits       (*(volatile TxSTAbits_t *)T2STA)

/*----------------------------
Watchdog Timer Byte register
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define T3LD            __UINT16__(0x40002580)
    #define T3VAL           __UINT16__(0x40002584)
    #define T3CON           __UINT16__(0x40002588)
    #define T3CLRI          __UINT16__(0x4000258C)
    #define T3STA           __UINT16__(0x40002598)
#endif

/*----------------------------
Watchdog Timer Bit field definitions
-----------------------------*/

typedef struct {
    unsigned LOAD           :16;
} T3LDbits_t;

#define T3LDbits        (*(volatile T3LDbits_t *)T3LD)

typedef struct {
    unsigned CCOUNT         :16;
} T3VALbits_t;

#define T3VALbits       (*(volatile T3VALbits_t *)T3VAL)

typedef struct {
    unsigned PMD            :1;
    unsigned IRQ            :1;
    unsigned PRE            :2;
    unsigned                :1;
    unsigned ENABLE         :1;
    unsigned MOD            :1;
    unsigned                :9;
} T3CONbits_t;

#define T3CONbits       (*(volatile T3CONbits_t *)T3CON)

typedef struct {
    unsigned CLRWDG         :16;
} T3CLRIbits_t;

#define T3CLRIbits      (*(volatile T3CLRIbits_t *)T3CLRI)

typedef struct {
    unsigned IRQ            :1;
    unsigned CLRI           :1;
    unsigned LD             :1;
    unsigned CON            :1;
    unsigned LOCK           :1;
    unsigned                :11;
} T3STAbits_t;

#define T3STAbits       (*(volatile T3STAbits_t *)T3STA)

/*----------------------------
Wake Up Timer Byte register
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define T4VAL0              __UINT16__(0x40002500)
    #define T4VAL1              __UINT16__(0x40002504)
    #define T4CON               __UINT16__(0x40002508)
    #define T4INC               __UINT16__(0x4000250C)
    #define T4WUFB0             __UINT16__(0x40002510)
    #define T4WUFB1             __UINT16__(0x40002514)
    #define T4WUFC0             __UINT16__(0x40002518)
    #define T4WUFC1             __UINT16__(0x4000251C)
    #define T4WUFD0             __UINT16__(0x40002520)
    #define T4WUFD1             __UINT16__(0x40002524)
    #define T4IEN               __UINT16__(0x40002528)
    #define T4STA               __UINT16__(0x4000252C)
    #define T4CLRI              __UINT16__(0x40002530)
    #define T4WUFA0             __UINT16__(0x4000253C)
    #define T4WUFA1             __UINT16__(0x40002540)
#endif

/*----------------------------
Wake Up Timer bit field definitions
-----------------------------*/

