prassanna-prasath/ADuCM320i/src/headers/pincm320i.h
typedef struct {
    unsigned T4VALL         :16;
} T4VAL0bits_t;

#define T4VAL0bits          (*(volatile T4VAL0bits_t *)T4VAL0)

typedef struct {
    unsigned T4VALH         :16;
} T4VAL1bits_t;

#define T4VAL1bits          (*(volatile T4VAL1bits_t *)T4VAL1)

typedef  struct {
    unsigned PRE            :2;
    unsigned                :1;
    unsigned FREEZE         :1;
    unsigned                :2;
    unsigned MOD            :1;
    unsigned ENABLE         :1;
    unsigned WUEN           :1;
    unsigned CLK            :2;
    unsigned STOP_WUFA      :1;
    unsigned                :4;
} T4CONbits_t;

#define T4CONbits       (*(volatile T4CONbits_t *)T4CON)

typedef struct {
    unsigned INTERVAL       :12;
    unsigned                :4;
} T4INCbits_t;

#define T4INCbits       (*(volatile T4INCbits_t *)T4INC)

typedef struct {
    unsigned T4WUFBL        :16;
} T4WUFB0bits_t;

#define T4WUFB0bits     (*(volatile T4WUFB0bits_t *)T4WUFB0)

typedef struct {
    unsigned T4WUFBH        :16;
} T4WUFB1bits_t;

#define T4WUFB1bits     (*(volatile T4WUFB1bits_t *)T4WUFB1)

typedef struct {
    unsigned T4WUFCL        :16;
} T4WUFC0bits_t;

#define T4WUFCLbits     (*(volatile T4WUFC0bits_t *)T4WUFC0)

typedef struct {
    unsigned T4WUFCH        :16;
} T4WUFC1bits_t;

#define T4WUFC1bits     (*(volatile T4WUFC1bits_t *)T4WUFC1)

typedef struct {
    unsigned WUFD0        :16;
} T4WUFD0bits_t;

#define T4WUFD0bits     (*(volatile T4WUFD0bits_t *)T4WUFD0)

typedef  struct {
    unsigned T4WUFDH        :16;
} T4WUFD1bits_t;

#define T4WUFD1bits     (*(volatile T4WUFD1bits_t *)T4WUFD1)

typedef struct {
    unsigned WUFA           :1;
    unsigned WUFB           :1;
    unsigned WUFC           :1;
    unsigned WUFD           :1;
    unsigned ROLL           :1;
    unsigned                :11;
} T4IENbits_t;

#define T4IENbits       (*(volatile T4IENbits_t *)T4IEN)

typedef struct {
    unsigned WUFA           :1;
    unsigned WUFB           :1;
    unsigned WUFC           :1;
    unsigned WUFD           :1;
    unsigned ROLL           :1;
    unsigned                :1;
    unsigned IRQCRY         :1;
    unsigned FREEZE         :1;
    unsigned PDOK           :1;
    unsigned                :7;
} T4STAbits_t;

#define T4STAbits       (*(volatile T4STAbits_t *)T4STA)

typedef struct {
    unsigned WUFA           :1;
    unsigned WUFB           :1;
    unsigned WUFC           :1;
    unsigned WUFD           :1;
    unsigned ROLL           :1;
    unsigned                :11;
} T4CLRIbits_t;

#define T4CLRIbits      (*(volatile T4CLRIbits_t *)T4CLRI)

typedef struct {
    unsigned T4WUFAL        :16;
} T4WUFA0bits_t;

#define T4WUFA0bits     (*(volatile T4WUFA0bits_t *)T4WUFA0)

typedef struct {
    unsigned T4WUFAH        :16;
} T4WUFA1bits_t;

#define T4WUFA1bits     (*(volatile T4WUFA1bits_t *)T4WUFA1)

/*----------------------------
PWM Byte register
-----------------------------*/
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
    #define PWMCON0             __UINT16__(0x40024000)
    #define PWMCON1             __UINT16__(0x40024004)
    #define PWMICLR             __UINT16__(0x40024008)
    #define PWM0COM0            __UINT16__(0x40024010)
    #define PWM0COM1            __UINT16__(0x40024014)
    #define PWM0COM2            __UINT16__(0x40024018)
    #define PWM0LEN             __UINT16__(0x4002401C)
    #define PWM1COM0            __UINT16__(0x40024020)
    #define PWM1COM1            __UINT16__(0x40024024)
    #define PWM1COM2            __UINT16__(0x40024028)
    #define PWM1LEN             __UINT16__(0x4002402C)
    #define PWM2COM0            __UINT16__(0x40024030)
    #define PWM2COM1            __UINT16__(0x40024034)
    #define PWM2COM2            __UINT16__(0x40024038)
    #define PWM2LEN             __UINT16__(0x4002403C)
    #define PWM3COM0            __UINT16__(0x40024040)
    #define PWM3COM1            __UINT16__(0x40024044)
    #define PWM3COM2            __UINT16__(0x40024048)
    #define PWM3LEN             __UINT16__(0x4002404C)
#endif

/*----------------------------
PWM Bit field definitions
-----------------------------*/
typedef struct {
    unsigned PWMEN              :1;
    unsigned HMODE              :1;
    unsigned DIR                :1;
    unsigned LCOMP              :1;
    unsigned HOFF               :1;
    unsigned POINV              :1;
    unsigned PWMCMP             :3;
    unsigned ENA                :1;
    unsigned PWMIEN             :1;
    unsigned PWM1INV            :1;
    unsigned PWM3INV            :1;
    unsigned PWM5INV            :1;
    unsigned PWM7INV            :1;
    unsigned SYNC               :1;
} PWMCON0bits_t;

#define PWMCON0bits     (*(volatile PWMCON0bits_t *)PWMCON0)

typedef struct {
    unsigned                    :6;
    unsigned TRIP_EN            :1;
    unsigned                    :9;
} PWMCON1bits_t;

#define PWMCON1bits     (*(volatile PWMCON1bits_t *)PWMCON1)

typedef struct {
    unsigned PWM0               :1;
    unsigned PWM1               :1;
    unsigned PWM2               :1;
    unsigned PWM3               :1;
    unsigned TRIP               :1;
    unsigned                    :11;
} PWMICLRbits_t;

#define PWMICLRbits     (*(volatile PWMICLRbits_t *)PWMICLR)

typedef struct {
    unsigned COM0               :16;
} PWMxCOM0bits_t;

#define PWM0COM0bits    (*(volatile PWMxCOM0bits_t *)PWM0COM0)
#define PWM1COM0bits    (*(volatile PWMxCOM0bits_t *)PWM1COM0)
#define PWM2COM0bits    (*(volatile PWMxCOM0bits_t *)PWM2COM0)
#define PWM3COM0bits    (*(volatile PWMxCOM0bits_t *)PWM3COM0)

typedef struct {
    unsigned COM1               :16;
} PWMxCOM1bits_t;

#define PWM0COM1bits    (*(volatile PWMxCOM1bits_t *)PWM0COM1)
#define PWM1COM1bits    (*(volatile PWMxCOM1bits_t *)PWM1COM1) 
#define PWM2COM1bits    (*(volatile PWMxCOM1bits_t *)PWM2COM1) 
#define PWM3COM1bits    (*(volatile PWMxCOM1bits_t *)PWM3COM1) 


typedef struct {
    unsigned COM0               :16;
} PWMxCOM0bits_t;

#define PWM0COM2bits    (*(volatile PWMxCOM2bits_t *)PWM0COM2)
#define PWM1COM2bits    (*(volatile PWMxCOM2bits_t *)PWM1COM2)
#define PWM2COM2bits    (*(volatile PWMxCOM2bits_t *)PWM2COM2)
#define PWM3COM2bits    (*(volatile PWMxCOM2bits_t *)PWM3COM2)

typedef struct {
    unsigned LEN                :16;
} PWMxLENbits_t;

#define PWM0LENbits     (*(volatile PWMxLENbits_t *)PWM0LEN)
#define PWM1LENbits     (*(volatile PWMxLENbits_t *)PWM1LEN)
#define PWM2LENbits     (*(volatile PWMxLENbits_t *)PWM2LEN)
#define PWM3LENbits     (*(volatile PWMxLENbits_t *)PWM3LEN)

#endif